
type - gift | bonus
Тип операции:
bonus - Начисление/списание бонусов
gift - Выдача подарков

client - Array
Массив с описанием клиента:
id_client - ID клиента
id_device - ID устройства клиента
id_ext - ID клиента в внешней системе
name - Имя клиента
phone - Телефон клиента
balance - Баланс бонусных баллов
k_bonus - Коэффициент начисления бонусных баллов(в процентах)
gifts - Массив с описанием доступных подарков для клиента
maxPayBonusK - % от заказа, который клиент может оплатить бонусами

gift - Array
Массив с описанием подарка, который хочет получить клиент:
id_gift - ID подарка в системе GMB
id_ext - ID подарка в системе клиента
name - Название подарка
description - Описание подарка
price - Стоимость подарка в бонусах
active - Признак активности ли подарок
can_use - Признак может ли клиент использовать подарок

-----

id_branch - integer
ID филиала, в котором совершена операция

id_manager - integer
ID сотрудника, совершающего операцию

manager_name - string
Имя сотрудника, совершающего операцию

branch_name - string
Название филиала, в котором была совершена операция

id_client - integer
ID клиента

id_device - integer
ID устройства клиента

order_price - integer
Сумма заказа

invoice_num - string
Номер чека

bonus_value - [integer]
Необязательное поле. Сумма баллов для начисления.
Если параметр передан - клиенту будет начислена переданная сумма баллов. Если не передан - баллы будут рассчитаны на стороне GetMeBack исходя из суммы покупки

paid_bonus - integer | null
Сумма бонусов, использованных для оплаты заказа. Положительное число. Если клиент потратил 200 бонусов, нужно прислать paid_bonus: 200

positions - Array | null
Многомерный массив с составом заказа.
id_product - ID товара или артикула в системе заказчика

-----

result - ok | error
Результат операции:
ok - операция прошла успешно
error - произошла ошибка

bonus_value - integer
Сумма начисленных клиенту бонусов

bonus_id - integer
Номер транзакции начисления баллов

client - Array
Массив с описанием клиента:
id_client - ID клиента
id_device - ID устройства клиента
id_ext - Внешний ID клиента
name - Имя клиента
phone - Телефон клиента
balance - Баланс бонусных баллов
k_bonus - Коэффициент начисления бонусных баллов(в процентах)
maxPayBonusK - % от заказа, который клиент может оплатить бонусами
gifts - Массив с описанием доступных подарков

-----


